Repository: ifm/iot-core
Catalog: source/ifmIoTCore/Resources/Resource1.*.resx
Languages: de_de

# AddAncestorElementNotAllowed
source: Adding element '{0}' to element '{1}' is not allowed, because it is an ancestor of element '{1}'
de_de: Hinzufügen von Element '{0}' zu Element '{1}' ist nicht erlaubt, da es bereits in der Baumhierarchie von Element '{1}' vorhanden ist

# AddElementToLinkNotAllowed
source: Adding an element to a link element is not allowed
de_de: Hinzufügen eines Elements zu einem Link-Element ist nicht erlaubt

# ArgumentNullOrEmpty
source: The argument with name '{0}' must not be null or empty
de_de: Das Argument mit dem Namen '{0}' darf nicht null oder leer sein

# ClientFactoryNotFound
source: The client factory for protocol '{0}' could not be found
de_de: Die Client-Factory für das Protokoll '{0}' wurde nicht gefunden

# ElementAlreadyExists
source: The element '{0}' already exists in element '{1}'
de_de: Das Element '{0}' existiert bereits in Element '{1}'

# ElementAlreadyHasParent
source: The element '{0}' already has parent element '{1}'
de_de: Das Element '{0}' hat bereits das Elternelement '{1}'

# ElementLocked
source: The element '{0}' is currently locked
de_de: Das Element '{0}' ist gerade gesperrt

# ElementManagerLocked
source: The element manager is currently locked
de_de: Der Elementmanager ist gerade gesperrt

# ElementNotChild
source: The element '{0}' is not the child element of element '{1}'
de_de: Das Element '{0}' ist nicht das Kindelement von Element '{1}'

# ElementNotFound
source: The element with address '{0}' could not be found
de_de: Das Element mit Adresse '{0}' wurde nicht gefunden

# ElementNotLinked
source: The element '{0}' is not linked from element '{1}'
de_de: Das Element '{0}' ist nicht verlinkt von Element '{1}'

# ElementNotService
source: The element with address '{0}' is not a service
de_de: Das Element mit Adresse '{0}' ist kein Service

# InvalidArgument
source: The argument '{0}' is invalid
de_de: Das Argument '{0}' ist ungültig

# InvalidArgumentType
source: The argument type '{0}' is invalid. Required type is '{1}'
de_de: Der Argumenttyp '{0}' ist nicht gültig. Der benötigte Typ ist '{1}'

# InvalidDeviceName
source: The device name in address '{0}' is invalid
de_de: Der Gerätename in Adresse '{0}' ist ungültig

# InvalidIdentifier
source: The identifier '{0}' is invalid
de_de: Der Identifier '{0}' ist ungültig

# InvalidMessageCode
source: The message code '{0}' is invalid
de_de: Der Nachrichtencode '{0}' ist ungültig

# InvalidName
source: The name '{0}' is invalid
de_de: Der Name '{0}' ist ungültig

# InvalidResponse
source: The remote service at {'0}' returned an invalid response
de_de: Der entfernte Service auf {'0}' gab eine ungültige Antwort

# InvalidUri
source: The uri '{0}' is invalid
de_de: Die Uri '{0}' ist ungültig

# IoTCoreStarted
source: The IoTCore has started. Version='{0}'
de_de: Der IoTCore ist gestartet. Version='{0}'

# IoTCoreStopped
source: The IoTCore has stopped
de_de: Der IoTCore ist gestoppt

# LinksNotModifiable
source: Links are not modifiable
de_de: Links können nicht verändert werden

# NameAlreadyUsed
source: The name '{0}' is already used
de_de: Der Name '{0}' wird bereits verwendet

# NameNotFound
source: The name '{0}' could not be found
de_de: Der Name '{0}' wurde nicht gefunden

# SendEventFailed
source: Sending event to '{0}' failed with error '{1}'
de_de: Senden eines Ereignisses an '{0}' ist mit Fehler '{1}' fehlgeschlagen

# SendRequestFailed
source: Sending request to '{0}' failed with error '{1}'
de_de: Senden einer Anfrage an '{0}' ist mit Fehler '{1}' fehlgeschlagen

# ServiceDataEmpty
source: The data for service '{0}' is empty. Please check the 'data' field in your request
de_de: Die Daten für Service '{0}' sind leer. Bitte überprüfen Sie das 'data' Feld in Ihrem Aufruf

# ServiceExecutionFailed
source: Service {0} failed. Message: {1}; code {2}
de_de: Service '{0}' ist fehlgeschlagen. Nachricht: '{1}'

# ServiceNotImplemented
source: The service '{0}' is not implemented
de_de: Der Service '{0}' ist nicht implementiert

# SubscriptionDataMissing
source: The subscription data was not supplied
de_de: Die Daten für die subscription wurde nicht angegeben

# SubscriptionNotFound
source: The subscription with identification '{0}' could not be found
de_de: Die subscription mit der Kennung '{0}'wurde nicht gefunden

# SubscriptionSetToLifeTimeButNoPersistenceManagerRegistered
source: The lifetime of the subscription was set to lifetime, but there is no persistence manager registered. To enable persistence please register a persistence manager.
de_de: Die subscription wurde mit der Lebenszeit "Lifetime" angegeben. Es ist jedoch kein persistence manager registriert. Bitte registrieren sie am iotcore einen persistence manager.
